IISSPTestApplication/bin/Debug/output.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <msg:Envelope xmlns:msg="urn:cz:mfcr:iissp:schemas:Messaging:v1">
      <msg:EnvelopeHeader>
        <cmn:TransactionId xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00000000000000024121</cmn:TransactionId>
        <msg:DateTimeCreated>2012-11-18T15:36:21+01:00</msg:DateTimeCreated>
        <msg:Sender>
          <cmn:IC xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00006947</cmn:IC>
          <cmn:SubjectName xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">Ministerstvo financí</cmn:SubjectName>
          <cmn:Module xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">RISRE</cmn:Module>
          <cmn:ResponsiblePerson xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">
            <cmn:PersonName>Kompetenční centrum</cmn:PersonName>
            <cmn:PersonId>KC</cmn:PersonId>
          </cmn:ResponsiblePerson>
        </msg:Sender>
        <msg:Recipient>
          <cmn:IC xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">00164801</cmn:IC>
          <cmn:SubjectName xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">IN-SY-CO</cmn:SubjectName>
          <cmn:ResponsiblePerson xmlns:cmn="urn:cz:mfcr:iissp:schemas:Common:v1">
            <cmn:PersonName>Tibor Stuchlik</cmn:PersonName>
            <cmn:Email>tibor@stuchlik.info</cmn:Email>
            <cmn:PersonId>EU8598098824</cmn:PersonId>
          </cmn:ResponsiblePerson>
        </msg:Recipient>
      </msg:EnvelopeHeader>
      <msg:EnvelopeBody>
        <msg:ZpravaRisreTestovaci>
          <msg:DataTestovaciOdpoved>
            <msg:TextZaslany>Test</msg:TextZaslany>
            <msg:ZpracovaniVysledek>
              <msg:TypMaximum>I</msg:TypMaximum>
              <msg:Polozka>
                <msg:Typ>I</msg:Typ>
                <msg:ID>ZZPITECH|900</msg:ID>
                <msg:Text>Volání testovací webové služby IISSP RISRE proběhlo v pořádku.</msg:Text>
              </msg:Polozka>
            </msg:ZpracovaniVysledek>
          </msg:DataTestovaciOdpoved>
        </msg:ZpravaRisreTestovaci>
      </msg:EnvelopeBody>
    </msg:Envelope>
  </soapenv:Body>
</soapenv:Envelope>